In [2]:
import pandas as pd

Bangladesh_weather = pd.DataFrame({
    "city": ["comilla","noakhali","khagrachori"],
    "temperature": [32,43,30],
    "humidity": [80, 60, 78]
})
Bangladesh_weather

          city  temperature  humidity
0      comilla           32        80
1     noakhali           43        60
2  khagrachori           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [5]:
pd.concat([Bangladesh_weather , us_weather])     # you can add multiple datset

          city  temperature  humidity
0      comilla           32        80
1     noakhali           43        60
2  khagrachori           30        78
0     new york           21        68
1      chicago           14        65
2      orlando           35        75

In [9]:
df = pd.concat([Bangladesh_weather , us_weather])
df

          city  temperature  humidity
0      comilla           32        80
1     noakhali           43        60
2  khagrachori           30        78
0     new york           21        68
1      chicago           14        65
2      orlando           35        75

In [10]:
type(df)

pandas.core.frame.DataFrame

In [13]:
# if you want countinous index
df = pd.concat([Bangladesh_weather, us_weather], ignore_index=True)
df

          city  temperature  humidity
0      comilla           32        80
1     noakhali           43        60
2  khagrachori           30        78
3     new york           21        68
4      chicago           14        65
5      orlando           35        75

In [14]:
df = pd.concat([Bangladesh_weather, us_weather], keys = ["Bangladesh" , "US"])
df

                     city  temperature  humidity
Bangladesh 0      comilla           32        80
           1     noakhali           43        60
           2  khagrachori           30        78
US         0     new york           21        68
           1      chicago           14        65
           2      orlando           35        75

In [16]:
df.loc["Bangladesh"]

          city  temperature  humidity
0      comilla           32        80
1     noakhali           43        60
2  khagrachori           30        78

In [19]:
tm_df = pd.DataFrame({
    "city": ["comilla","noakhali","khagrachori"],
    "temperature": [32,43,30]})
tm_df

          city  temperature
0      comilla           32
1     noakhali           43
2  khagrachori           30

In [24]:
ws_df = pd.DataFrame({
    "city": ["comilla","noakhali","khagrachori"],
    "windspeed": [41,30,29]})
ws_df

          city  windspeed
0      comilla         41
1     noakhali         30
2  khagrachori         29

In [25]:
pd.concat([tm_df , ws_df])

          city  temperature  windspeed
0      comilla         32.0        NaN
1     noakhali         43.0        NaN
2  khagrachori         30.0        NaN
0      comilla          NaN       41.0
1     noakhali          NaN       30.0
2  khagrachori          NaN       29.0

In [26]:
# if windspeed is a column
pd.concat([tm_df , ws_df] , axis = 1)

          city  temperature         city  windspeed
0      comilla           32      comilla         41
1     noakhali           43     noakhali         30
2  khagrachori           30  khagrachori         29

In [28]:
wsp_df = pd.DataFrame({
    "city": ["noakhali" , "comilla"],
    "windspeed": [28,49]})
wsp_df

       city  windspeed
0  noakhali         28
1   comilla         49

In [29]:
pd.concat([tm_df , wsp_df] , axis = 1)

          city  temperature      city  windspeed
0      comilla           32  noakhali       28.0
1     noakhali           43   comilla       49.0
2  khagrachori           30       NaN        NaN


<h3>Comilla should be the first in second set<h3>

In [30]:

ws_df = pd.DataFrame({
    "city": ["comilla","noakhali","khagrachori"],
    "windspeed": [41,30,29]} , index = [0,1,2])
ws_df

          city  windspeed
0      comilla         41
1     noakhali         30
2  khagrachori         29

In [31]:
wsp_df = pd.DataFrame({
    "city": ["noakhali" , "comilla"],
    "windspeed": [28,49]} , index = [1,0])
wsp_df

       city  windspeed
1  noakhali         28
0   comilla         49

In [32]:
pd.concat([tm_df , wsp_df] , axis = 1)

          city  temperature      city  windspeed
0      comilla           32   comilla       49.0
1     noakhali           43  noakhali       28.0
2  khagrachori           30       NaN        NaN

In [33]:
s = pd.Series(["Humid","Dry","Rain"], name="event")
s

0    Humid
1      Dry
2     Rain
Name: event, dtype: object

In [35]:
pd.concat([tm_df,s],axis=1)

          city  temperature  event
0      comilla           32  Humid
1     noakhali           43    Dry
2  khagrachori           30   Rain